#include <iostream> 
#include <cstdlib>
#include <ctime>

using namespace std; // использование пространства имен std

int main() 
{ 
    srand(time(0)); // инициализация генератора случайных чисел
    int randomNumber = rand() % 10 + 1; // генерация случайного числа от 1 до 10
    int guess; // определение переменной для ввода догадки игрока
    int tries = 0; // определение переменной для подсчета количества попыток

    cout << "Добро пожаловать в игру 'Угадай число'!" << endl; // вывод приветствия

    do { // начало цикла do-while
        cout << "Введите число от 1 до 10: "; // вывод приглашения на ввод догадки
        cin >> guess; // чтение догадки игрока из консоли
        tries++; // увеличение количества попыток на 1

        if (guess > randomNumber) { // проверка догадки игрока на больше, чем случайное число
            cout << "Слишком большое число! Попробуйте еще раз." << endl; // вывод сообщения о том, что число слишком большое
        } else if (guess < randomNumber) { // проверка догадки игрока на меньше, чем случайное число
            cout << "Слишком маленькое число! Попробуйте еще раз." << endl; // вывод сообщения о том, что число слишком маленькое
        } else { // если догадка игрока совпадает со случайным числом
            cout << endl << "Поздравляю! Вы угадали число за " << tries << " попыток!" << endl; // вывод сообщения о победе и количестве попыток
        }
    } while (guess != randomNumber); // конец цикла do-while, продолжать, пока догадка игрока не совпадет со случайным числом

    return 0; // возврат нуля, что указывает на успешное завершение программы
}
